init.org
** start maximized
Start emacs with a maximized frame.
#+begin_src emacs-lisp
(toggle-frame-maximized)

(general-define-key
 "M-<f10>"   'toggle-frame-maximized
 "M-S-<f10>" 'toggle-frame-fullscreen)
#+end_src

** various unsorted stuff
Most of this is copied from other emacs configs.
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook   'subword-mode)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
(add-hook 'before-save-hook
          (lambda ()
            (when buffer-file-name
              (let ((dir (file-name-directory buffer-file-name)))
                (when (and (not (file-exists-p dir))
                           (y-or-n-p (format "Directory %s does not exist. Create it?" dir)))
                  (make-directory dir t))))))

(blink-cursor-mode       0)
(delete-selection-mode   1)
(transient-mark-mode     1) ; https://www.emacswiki.org/emacs/TransientMarkMode
(save-place-mode         1) ; https://www.emacswiki.org/emacs/SavePlace
;;(save-hist-mode          1)
(show-paren-mode         1) ; Indicate matching pairs of parentheses
(column-number-mode      1)
(global-font-lock-mode   t) ; is this really a good idea?
(global-auto-revert-mode t) ; refresh buffer on file change

(setq-default cursor-type           'bar
              indent-tabs-mode       nil  ; indent with space
              fill-column            80   ; always break at 80
              abbrev-mode            t
              dired-listing-switches "-alh")

(require 'uniquify)
(setq uniquify-buffer-name-style          'forward ; unique buffer names
      show-paren-delay                    0.0
      tab-width                           2
      delete-selection-mode               t
      sentence-end-double-space           nil
      vc-follow-symlinks                  t
      default-directory                   "~/"
      confirm-kill-emacs                  'y-or-n-p
      require-final-newline               t
      visible-bell                        t
      save-interprogram-paste-before-kill t
      apropos-do-all                      t
      save-abbrevs                        'silently
      large-file-warning-threshold        (* 15 1024 1024)
      global-mark-ring-max                500  ; we have buttloads of
      mark-ring-max                       500  ; memory, might as well
      kill-ring-max                       500) ; use it

(fset 'yes-or-no-p 'y-or-n-p)

(setq backup-directory-alist `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))
#+end_src

* ui
Everything remotely "UI"-related goes here.
** fonts
Monospaced fonts makes life easier. Currently, my favorite is [[https://github.com/tonsky/FiraCode][Fira Code]].
#+begin_src emacs-lisp
(set-face-attribute
 'default        nil :family "Fira Code" :height 180 :weight 'light)
(set-face-attribute
 'fixed-pitch    nil :family "Fira Code" :height 180 :weight 'light)
(set-face-attribute
 'variable-pitch nil :family "Fira Code" :height 180 :weight 'light)
#+end_src

emacs 27 introduced the new =:extend= face attribute. In turn, this makes my
org-blocks look weird when switching themes. This fixes it?
#+begin_src emacs-lisp
(defun knube/fix-org-blocks ()
  (interactive)
  (eval-after-load 'org
    (lambda ()
      (set-face-attribute
       'org-block nil :extend t)
      (set-face-attribute 'org-block-begin-line nil :extend t
                          :underline nil :overline nil
                          :slant 'italic)
      (set-face-attribute 'org-block-end-line nil :extend t
                          :underline nil :overline nil
                          :slant 'italic))))
#+end_src

** theme
[[https://protesilaos.com/modus-themes/][modus-themes]] work just fine. We switch between light and dark theme with =<f5>=.
#+begin_src emacs-lisp
(use-package modus-themes
  :init
  (setq modus-themes-org-blocks     'tinted-background
        modus-themes-scale-headings t)
  :config
  (modus-themes-load-themes)
  (modus-themes-load-operandi)
  (knube/fix-org-blocks)
  :general
  ("<f5>" 'knube/toggle-themes))

(defun knube/toggle-themes ()
  (interactive)
  (modus-themes-toggle)
  (knube/fix-org-blocks))
#+end_src

** modeline
*** minions
[[https://github.com/tarsius/minions][minions]] packs all minor modes into one little icon.
#+begin_src emacs-lisp
(use-package minions
  :init
  (setq minions-mode-line-lighter    "☰"
        minions-mode-line-delimiters '("" . ""))
  :config
  (minions-mode +1))
#+end_src

*** telephone-line
[[https://github.com/dbordak/telephone-line][telephone-line]] looks good
#+begin_src emacs-lisp
(use-package telephone-line
  :init
  (setq telephone-line-lhs
        '((evil   . (telephone-line-evil-tag-segment
                     telephone-line-airline-position-segment))
          (accent . (telephone-line-buffer-name-segment))
          (nil    . (telephone-line-buffer-modified-segment)))

        telephone-line-rhs
        '((nil    . (telephone-line-minions-mode-segment))
          (accent . (telephone-line-vc-segment))
          (nil    . (telephone-line-misc-info-segment))))
  (setq display-time-24hr-format            t
        display-time-day-and-date           t
        display-time-default-load-average   nil
        display-time-load-average           nil
        display-time-load-average-threshold nil)
  :config
  (unless (equal "Battery status not available"
                 (battery))
    (display-battery-mode +1))
  (display-time-mode +1)
  (telephone-line-mode +1))
#+end_src

** writeroom
I use [[https://github.com/joostkremers/writeroom-mode][writeroom-mode]] for an uncluttered and minimalistic writing experience.
#+begin_src emacs-lisp
(use-package writeroom-mode
  :general
  ("<f6>" 'writeroom-mode))
#+end_src

* evil
Even though I've used vim in the past, I'm not one of those "hardcore
ex-vimmers". But, modal editing is nifty and it will probably save me quite some
time in the long run.

** evil-mode and evil-collection
Staple and must have packages, both from https://github.com/emacs-evil/
#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-keybinding  nil
        evil-want-integration t
        evil-want-fine-undo   t)
  :config
  (evil-mode +1))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src

** evil-nerd-commenter
Provides a powerful tool for commenting lines. See
https://github.com/redguardtoo/evil-nerd-commenter for full description.
#+begin_src emacs-lisp
(use-package evil-nerd-commenter
  :after evil
  :config
  (evilnc-default-hotkeys))
#+end_src

*** TODO This makes some of my earlier keybindings superfluous. Go back and fix that.

** evil-matchit
Use =%= to jump between matching tags. See https://github.com/redguardtoo/evil-matchit
#+begin_src emacs-lisp
(use-package evil-matchit
  :after evil
  :config
  (global-evil-matchit-mode +1))
#+end_src


** evil-lion
https://github.com/edkolev/evil-lion
#+begin_src emacs-lisp
(use-package evil-lion
  :after evil
  :config
  (evil-lion-mode +1))
#+end_src

* completion
** emacs ui completion
*** selectrum
[[https://github.com/raxod502/selectrum][selectrum]] for incremental narrowing in emacs.
#+begin_src emacs-lisp
(use-package selectrum
  :general
  ("C-x C-z" 'selectrum-repeat)
  :config
  (selectrum-mode +1))

(use-package selectrum-prescient
  :config
  (selectrum-prescient-mode +1)
  (prescient-persist-mode +1))
#+end_src

