init.org
*** consult
[[https://github.com/minad/consult][consult]] builds on emacs' [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Minibuffer-Completion.html][completing-read]]. Works well with selectrum, marginalia and embark.
#+begin_src emacs-lisp
;; Example configuration for Consult
(use-package consult
  :after org
  :general
  (;; C-c bindings (mode-specific-map)
   "C-c h" 'consult-history
   "C-c m" 'consult-mode-command
   "C-c b" 'consult-bookmark
   "C-c k" 'consult-kmacro

   ;; C-x bindings (ctl-x-map)
   "C-x M-:" 'consult-complex-command     ;; orig. repeat-complex-command
   "C-x b"   'consult-buffer              ;; orig. switch-to-buffer
   "C-x 4 b" 'consult-buffer-other-window ;; orig. switch-to-buffer-other-window
   "C-x 5 b" 'consult-buffer-other-frame  ;; orig. switch-to-buffer-other-frame

   ;; Custom M-# bindings for fast register access
   "M-#"   'consult-register-load
   "M-'"   'consult-register-store ;; orig. abbrev-prefix-mark (unrelated)
   "C-M-#" 'consult-register

   ;; Other custom bindings
   "M-y"      'consult-yank-pop ;; orig. yank-pop
   "<help> a" 'consult-apropos  ;; orig. apropos-command

   ;; M-g bindings (goto-map)
   "M-g e"   'consult-compile-error
   "M-g f"   'consult-flymake       ;; Alternative: consult-flycheck
   "M-g g"   'consult-goto-line     ;; orig. goto-line
   "M-g M-g" 'consult-goto-line     ;; orig. goto-line
   "M-g o"   'consult-outline       ;; Alternative: consult-org-heading
   "M-g m"   'consult-mark
   "M-g k"   'consult-global-mark
   "M-g i"   'consult-imenu
   "M-g I"   'consult-imenu-multi

   ;; M-s bindings (search-map)
   "M-s f" 'consult-find
   "M-s F" 'consult-locate
   "M-s g" 'consult-grep
   "M-s G" 'consult-git-grep
   "M-s r" 'consult-ripgrep
   "M-s l" 'consult-line
   "M-s L" 'consult-line-multi
   "M-s m" 'consult-multi-occur
   "M-s k" 'consult-keep-lines
   "M-s u" 'consult-focus-lines

   ;; Isearch integration
   "M-s e" 'consult-isearch)
  (:keymaps 'isearch-mode-map
            "M-e"   'consult-isearch     ;; orig. isearch-edit-string
            "M-s e" 'consult-isearch     ;; orig. isearch-edit-string
            "M-s l" 'consult-line        ;; needed by consult-line to detect isearch
            "M-s L" 'consult-line-multi) ;; needed by consult-line to detect isearch

  ;; Enable automatic preview at point in the *Completions* buffer.
  ;; This is relevant when you use the default completion UI,
  ;; and not necessary for Vertico, Selectrum, etc.
  :hook
  (completion-list-mode . consult-preview-at-point-mode)

  ;; The :init configuration is always executed (Not lazy)
  :init

  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setq register-preview-delay    0
        register-preview-function #'consult-register-format)

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Optionally replace `completing-read-multiple' with an enhanced version.
  (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)

  ;; Use Consult to select xref locations with preview
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  ;; Configure other variables and modes in the :config section,
  ;; after lazily loading the package.
  :config

  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key (kbd "M-."))
  ;; (setq consult-preview-key (list (kbd "<S-down>") (kbd "<S-up>")))
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  (consult-customize
   consult-theme
   :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-file consult--source-project-file consult--source-bookmark
   :preview-key (kbd "M-."))

  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (setq consult-narrow-key "<") ;; (kbd "C-+")

  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

  ;; Optionally configure a function which returns the project root directory.
  ;; There are multiple reasonable alternatives to chose from.
  ;;;; 1. project.el (project-roots)
  (setq consult-project-root-function
        (lambda ()
          (when-let (project (project-current))
            (car (project-roots project)))))
  ;;;; 2. projectile.el (projectile-project-root)
  ;; (autoload 'projectile-project-root "projectile")
  ;; (setq consult-project-root-function #'projectile-project-root)
  ;;;; 3. vc.el (vc-root-dir)
  ;; (setq consult-project-root-function #'vc-root-dir)
  ;;;; 4. locate-dominating-file
  ;; (setq consult-project-root-function (lambda () (locate-dominating-file "." ".git")))
)
#+end_src

*** marginalia
[[https://github.com/minad/marginalia][marginalia]] adds annotations to minibuffer completions.
#+begin_src emacs-lisp
(use-package marginalia
  :general
  (:keymaps 'minibuffer-local-map
           "M-S-a" 'marginalia-cycle)
  :config
  (marginalia-mode +1))
#+end_src

*** embark
[[https://github.com/oantolin/embark][embark]] provides a contextual menu through =embark-act=.
#+begin_src emacs-lisp
(use-package embark
  :general
  ("C-."   'embark-act
   "C-;"   'embark-dwim        ;; good alternative: M-.
   "C-h B" 'embark-bindings) ;; alternative for `describe-bindings'

  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

(use-package embark-consult
  :after (embark consult)
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

** citations

*** bibtex-actions
[[https://github.com/bdarcus/bibtex-actions][bibtex-actions]] uses the framework provided above for quick and easy bibtex citations.
#+begin_src emacs-lisp
(setq knube/bibs '("~/Dropbox/org/bibfiles/references.bib"))
(use-package citeproc)
(use-package bibtex-actions
  :after (embark org)
  :config
  (require 'oc-bibtex-actions)
  (setq bibtex-completion-bibliography             knube/bibs
        bibtex-completion-additional-search-fields '(doi url)
        bibtex-actions-at-point-function           'embark-act
        org-cite-global-bibliography               knube/bibs
        org-cite-insert-processor                  'oc-bibtex-actions
        org-cite-follow-processor                  'oc-bibtex-actions
        org-cite-activate-processor                'basic)
  (add-to-list 'embark-target-finders 'bibtex-actions-citation-key-at-point)
  (add-to-list 'embark-keymap-alist   '(bibtex . bibtex-actions-map))
  (add-to-list 'embark-keymap-alist   '(citation-key . bibtex-actions-buffer-map))
  :general
  ("C-c [" 'org-cite-insert
   "M-o"   'org-open-at-point)
  (:keymaps 'minibuffer-local-map
            "M-b" 'bibtex-actions-insert-preset))

;; Use consult-completing-read for enhanced interface.
(advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)
#+end_src

** code completion
