init.org
*** company
Code completion with /frecency/. [[http://company-mode.github.io/][company]] has several addons and backends, those
will be installed and configured in their respective sections later.

#+begin_src emacs-lisp
(use-package company
  :init
  (setq company-idle-delay                0.5
        company-show-numbers              t
        company-tooltip-limit             10
        company-minimum-prefix-length     2
        company-tooltip-align-annotations t
        ;; invert the navigation direction if the the completion
        ;; popup-isearch-match is displayed on top (happens near the bottom of
        ;; windows)
        company-tooltip-flip-when-above   t)
  :config
  (global-company-mode +1))


(use-package company-prescient
  :config
  (company-prescient-mode +1))
#+end_src

** yasnippet
[[https://github.com/joaotavora/yasnippet][yasnippet]] is great for providing bigger templates for your =.tex=- or =.org=-files.
#+begin_src emacs-lisp
(use-package yasnippet
  :init
  (setq yas-snippet-dirs '("~/.emacs.d/snippets"))
  :config
  (yas-global-mode +1))
#+end_src

* org-mode
org-mode is absolutely brilliant
** org
#+begin_src emacs-lisp
  (use-package org-contrib)
  (use-package org
    :config
    (require 'oc)
    (require 'oc-basic)
    (require 'oc-csl)
    (require 'oc-biblatex)
    (require 'oc-natbib)
    ;; (require 'ox-bibtex)
    ;; (require 'ob-latex)
    ;; (require 'ob-emacs-lisp)

    (setq org-list-allow-alphabetical      t
          org-fontify-whole-heading-line   t
          org-startup-indented             nil  ; indent sections
          org-indent-indentation-per-level 0
          org-adapt-indentation            nil
          org-src-tab-acts-natively        t     ; tab works as in any major mode
          org-src-preserve-indentation     t
          org-log-into-drawer              t     ; wtf is this?
          org-src-fontify-natively         t     ; highlight code
          org-log-done                     'time ; add dates on completion of TODOs
          org-support-shift-select         t     ; select holding down shift
          org-startup-truncated            nil
          org-directory                    "~/Dropbox/org"
          org-agenda-files                 '("~/Dropbox/org/agenda")
          org-ellipsis                     " ⤵"
          org-src-window-setup             'current-window
          org-latex-pdf-process            (list "latexmk -xelatex -f %f"))

    (add-hook 'org-mode-hook (lambda ()
                               (add-to-list 'org-structure-template-alist
                                            '("se" . "src emacs-lisp"))))

    (org-babel-do-load-languages 'org-babel-load-languages
                                 '((emacs-lisp . t)
                                   (latex      . t)))
    (general-unbind
      :keymaps 'org-mode-map
      "C-c '"  ; redefined below
      "C-c [") ; I have no need to "put whatever to the front of the agenda"

    :general
    (:keymaps 'org-mode-map
              "C-c C-'" 'org-edit-special)
    (:keymaps 'org-src-mode-map
              "C-c C-'" 'org-edit-src-exit))
#+end_src

** org-roam
TODO
** company-org-block
[[https://github.com/xenodium/company-org-block][company-org-block]] triggers with "<" and lets me quickly find the correct
org-block. ='auto= immediately triggers =org-edit-special=.
#+begin_src emacs-lisp
(use-package company-org-block
  :after (org company)
  :init
  (setq company-org-block-edit-style 'auto) ;; 'auto, 'prompt, or 'inline
  :config
  (add-hook 'org-mode-hook
            (lambda ()
              (add-to-list (make-local-variable 'company-backends)
                           'company-org-block))))
#+end_src

* latex
** auctex
#+begin_src emacs-lisp
(straight-use-package 'auctex)

(add-hook 'LaTeX-mode-hook 'reftex-mode)
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
(add-hook 'LaTeX-mode-hook 'TeX-PDF-mode)

(setq-default TeX-master nil
              TeX-engine 'xetex)

(setq TeX-source-correlate-method 'synctex
      TeX-source-correlate        t
      TeX-PDF-mode                t
      TeX-auto-save               t
      TeX-save-query              nil
      TeX-parse-self              t
      reftex-plug-into-AUCTeX     t
      TeX-view-program-list       '(("Skim" "/Applications/Skim.app/Contents/SharedSupport/displayline -g %n %o %b"))
      TeX-view-program-selection  '((output-pdf "Skim"))
      TeX-clean-confirm           nil)

;; make sure everything works fine with latexmk
(straight-use-package 'auctex-latexmk)

(setq auctex-latexmk-inherit-TeX-PDF-mode t)

(auctex-latexmk-setup)
#+end_src

** cdlatex
[[https://github.com/cdominik/cdlatex][cdlatex]] is quick and simple.
#+begin_src emacs-lisp
(straight-use-package 'cdlatex)

(add-hook 'org-mode-hook   'turn-on-org-cdlatex)
(add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)

(setq cdlatex-env-alist
      '(("equation*" "\\begin{equation*}\n?\n\\end{equation*}\n" nil)))
#+end_src

** company-auctex
company completion for auctex. Do I need this?
#+begin_src emacs-lisp
;; (straight-use-package 'company-auctex)
;; (company-auctex-init)
#+end_src

** company-bibtex
Not sure?

* Local variables
# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t)
# End:
